num = int (input ("Введите положительное число: "))
if num < 0:
    print ("False\n")
    print ("Вы ввели число меньше 0")
if num < -10:
    print ("Вы ввели число меньше -10")
elif num == -10:
    print ("Вы ввели число равное -10")
else:
    print ("Вы ввели число больше -10")
if num < -100:
    print ("Вы ввели число меньше -100")
elif num == -100:
    print ("Вы ввели число равное -100")
else:
    print ("Вы ввели число больше -100")

if num == 0:
    print ("True\n")
    print ("Вы ввели число равное 0")
elif num > 0:
    print ("True\n")
    print ("Вы ввели число больше 0")
if num < 10:
    print ("Вы ввели число меньше 10")
elif num == 10:
    print ("Вы ввели число равное 10")
else:
    print ("Вы ввели число больше 10")
if num < 100:
    print ("Вы ввели число меньше 100")
elif num == 100:
    print ("Вы ввели число равное 100")
else:
    print ("Вы ввели число больше 100")
    
a = input ()